app/controllers/posts_controller.rb

INSERT INTO `posts` (`name`, `updated_at`, `title`, `content`, `created_at`) VALUES('a', '2010-04-30 20:40:36', 'basdfadfa', 'c', '2010-04-30 20:40:36')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save